In [5]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv('./Churn_Modelling.csv')

In [4]:
df.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [8]:
users = df[['CustomerId', 'Surname','Geography',
       'Gender', 'Age','EstimatedSalary']]
users.head(3)

NameError: name 'df' is not defined

In [ ]:
bank = df[['CustomerId', 'CreditScore','Tenure',
       'Balance', 'NumOfProducts','HasCrCard','IsActiveMember','Exited']]
bank.head(3)

In [15]:
users.to_csv('users.csv', index=False, sep=';', encoding='utf-8')

In [16]:
bank.to_csv('bank.csv', index=False, sep=',', encoding='utf-8')

In [10]:
users = pd.read_csv('users.csv', sep=';')
users.head()

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary
0    15634602  Hargrave    France  Female   42        101348.88
1    15647311      Hill     Spain  Female   41        112542.58
2    15619304      Onio    France  Female   42        113931.57
3    15701354      Boni    France  Female   39         93826.63
4    15737888  Mitchell     Spain  Female   43         79084.10

In [6]:
users.shape

(10000, 6)

### Создание новых признаков

In [7]:
users['new_feature'] = 0
users.head()

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary  new_feature
0    15634602  Hargrave    France  Female   42        101348.88            0
1    15647311      Hill     Spain  Female   41        112542.58            0
2    15619304      Onio    France  Female   42        113931.57            0
3    15701354      Boni    France  Female   39         93826.63            0
4    15737888  Mitchell     Spain  Female   43         79084.10            0

In [8]:
users['Age (days)'] = users['Age'] * 365
users.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,new_feature,Age (days)
0,15634602,Hargrave,France,Female,42,101348.88,0,15330
1,15647311,Hill,Spain,Female,41,112542.58,0,14965
2,15619304,Onio,France,Female,42,113931.57,0,15330
3,15701354,Boni,France,Female,39,93826.63,0,14235
4,15737888,Mitchell,Spain,Female,43,79084.10,0,15695

In [9]:
for i, row in users.iloc[:2].iterrows(): # iterrows - итерирование по строчкам
    print(row)
    print('__' * 30) # добавление прочерка

CustomerId          15634602
Surname             Hargrave
Geography             France
Gender                Female
Age                       42
EstimatedSalary    101348.88
new_feature                0
Age (days)             15330
Name: 0, dtype: object
____________________________________________________________
CustomerId          15647311
Surname                 Hill
Geography              Spain
Gender                Female
Age                       41
EstimatedSalary    112542.58
new_feature                0
Age (days)             14965
Name: 1, dtype: object
____________________________________________________________

In [10]:
age_days = [] # создаем пустой лист

for i, row in users.iterrows():
    age_days.append(row['Age'] * 365)

age_days[:10]

[15330, 14965, 15330, 14235, 15695, 16060, 18250, 10585, 16060, 9855]

In [11]:
users['Age (days) 2'] = age_days
users.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,new_feature,Age (days),Age (days) 2
0,15634602,Hargrave,France,Female,42,101348.88,0,15330,15330
1,15647311,Hill,Spain,Female,41,112542.58,0,14965,14965
2,15619304,Onio,France,Female,42,113931.57,0,15330,15330
3,15701354,Boni,France,Female,39,93826.63,0,14235,14235
4,15737888,Mitchell,Spain,Female,43,79084.10,0,15695,15695

In [12]:
def age_to_days(x):
    return x * 365

users['Age (days) 3'] = users['Age'].apply(age_to_days)
users.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,new_feature,Age (days),Age (days) 2,Age (days) 3
0,15634602,Hargrave,France,Female,42,101348.88,0,15330,15330,15330
1,15647311,Hill,Spain,Female,41,112542.58,0,14965,14965,14965
2,15619304,Onio,France,Female,42,113931.57,0,15330,15330,15330
3,15701354,Boni,France,Female,39,93826.63,0,14235,14235,14235
4,15737888,Mitchell,Spain,Female,43,79084.10,0,15695,15695,15695

In [11]:
import time
from tqdm import tqdm
tqdm.pandas()


def age_to_days(x):
    time.sleep(0.001)
    return x * 365

users['Age'].progress_apply(age_to_days)

  0%|          | 0/10000 [00:00<?, ?it/s]

100%|██████████| 10000/10000 [00:12<00:00, 788.04it/s]

0       15330
1       14965
2       15330
3       14235
4       15695
        ...
9995    14235
9996    12775
9997    13140
9998    15330
9999    10220
Name: Age, Length: 10000, dtype: int64

## Удаление признаков

In [14]:
users.drop(columns='new_feature')
users.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,new_feature,Age (days),Age (days) 2,Age (days) 3
0,15634602,Hargrave,France,Female,42,101348.88,0,15330,15330,15330
1,15647311,Hill,Spain,Female,41,112542.58,0,14965,14965,14965
2,15619304,Onio,France,Female,42,113931.57,0,15330,15330,15330
3,15701354,Boni,France,Female,39,93826.63,0,14235,14235,14235
4,15737888,Mitchell,Spain,Female,43,79084.10,0,15695,15695,15695

In [19]:
users = users.drop(columns='new_feature')
users.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,Age (days),Age (days) 2,Age (days) 3
0,15634602,Hargrave,France,Female,42,101348.88,15330,15330,15330
1,15647311,Hill,Spain,Female,41,112542.58,14965,14965,14965
2,15619304,Onio,France,Female,42,113931.57,15330,15330,15330
3,15701354,Boni,France,Female,39,93826.63,14235,14235,14235
4,15737888,Mitchell,Spain,Female,43,79084.10,15695,15695,15695

In [17]:
users['new_feature'] = 0
users.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,Age (days),Age (days) 2,Age (days) 3,new_feature
0,15634602,Hargrave,France,Female,42,101348.88,15330,15330,15330,0
1,15647311,Hill,Spain,Female,41,112542.58,14965,14965,14965,0
2,15619304,Onio,France,Female,42,113931.57,15330,15330,15330,0
3,15701354,Boni,France,Female,39,93826.63,14235,14235,14235,0
4,15737888,Mitchell,Spain,Female,43,79084.10,15695,15695,15695,0

In [18]:
users.drop(columns='new_feature', inplace=True) # inplace=True - перезапись
users.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,Age (days),Age (days) 2,Age (days) 3
0,15634602,Hargrave,France,Female,42,101348.88,15330,15330,15330
1,15647311,Hill,Spain,Female,41,112542.58,14965,14965,14965
2,15619304,Onio,France,Female,42,113931.57,15330,15330,15330
3,15701354,Boni,France,Female,39,93826.63,14235,14235,14235
4,15737888,Mitchell,Spain,Female,43,79084.10,15695,15695,15695

In [19]:
users.drop(columns=['Age (days)', 'Age (days) 2', 'Age (days) 3'], inplace=True) # inplace=True - перезапись
users.head()

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary
0    15634602  Hargrave    France  Female   42        101348.88
1    15647311      Hill     Spain  Female   41        112542.58
2    15619304      Onio    France  Female   42        113931.57
3    15701354      Boni    France  Female   39         93826.63
4    15737888  Mitchell     Spain  Female   43         79084.10

## Изменение существующих признаков

.loc

In [23]:
users['target'] = 0
users.head()

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary  target
0    15634602  Hargrave    France  Female   42        101348.88       0
1    15647311      Hill     Spain  Female   41        112542.58       0
2    15619304      Onio    France  Female   42        113931.57       0
3    15701354      Boni    France  Female   39         93826.63       0
4    15737888  Mitchell     Spain  Female   43         79084.10       0

In [24]:
users.loc[users['Geography'] == 'France']

      CustomerId    Surname Geography  Gender  Age  EstimatedSalary  target
0       15634602   Hargrave    France  Female   42        101348.88       0
2       15619304       Onio    France  Female   42        113931.57       0
3       15701354       Boni    France  Female   39         93826.63       0
6       15592531   Bartlett    France    Male   50         10062.80       0
8       15792365         He    France    Male   44         74940.50       0
...          ...        ...       ...     ...  ...              ...     ...
9994    15719294       Wood    France  Female   29        167773.55       0
9995    15606229   Obijiaku    France    Male   39         96270.64       0
9996    15569892  Johnstone    France    Male   35        101699.77       0
9997    15584532        Liu    France  Female   36         42085.58       0
9999    15628319     Walker    France  Female   28         38190.78       0

[5014 rows x 7 columns]

In [25]:
users.loc[users['Geography'] == 'France', 'target']

0       0
2       0
3       0
6       0
8       0
       ..
9994    0
9995    0
9996    0
9997    0
9999    0
Name: target, Length: 5014, dtype: int64

In [26]:
users[users['Geography'] == 'France']['target'] = 1
users.head()

C:\Users\tonic\AppData\Local\Temp\ipykernel_19324\1082220520.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  users[users['Geography'] == 'France']['target'] = 1

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary  target
0    15634602  Hargrave    France  Female   42        101348.88       0
1    15647311      Hill     Spain  Female   41        112542.58       0
2    15619304      Onio    France  Female   42        113931.57       0
3    15701354      Boni    France  Female   39         93826.63       0
4    15737888  Mitchell     Spain  Female   43         79084.10       0

In [27]:
users.loc[users['Geography'] == 'France', 'target'] = 1
users.head()

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary  target
0    15634602  Hargrave    France  Female   42        101348.88       1
1    15647311      Hill     Spain  Female   41        112542.58       0
2    15619304      Onio    France  Female   42        113931.57       1
3    15701354      Boni    France  Female   39         93826.63       1
4    15737888  Mitchell     Spain  Female   43         79084.10       0

.replace

In [28]:
users['Gender'].replace({'Female': 'F', 'Male': 'M'}, inplace=True)
users.head()

   CustomerId   Surname Geography Gender  Age  EstimatedSalary  target
0    15634602  Hargrave    France      F   42        101348.88       1
1    15647311      Hill     Spain      F   41        112542.58       0
2    15619304      Onio    France      F   42        113931.57       1
3    15701354      Boni    France      F   39         93826.63       1
4    15737888  Mitchell     Spain      F   43         79084.10       0

## Методы агрегации

In [29]:
users['Age'].agg(['min', 'max'])

min    18
max    92
Name: Age, dtype: int64

In [30]:
users.agg({
    'Age': ['min', 'max'],
    'EstimatedSalary': 'mean'
})

       Age  EstimatedSalary
min   18.0              NaN
max   92.0              NaN
mean   NaN    100090.239881

In [31]:
users.agg(
    min_age=('Age', 'min'),
    max_age=('Age', 'max'),
    mean_salary=('EstimatedSalary', 'mean')
)

              Age  EstimatedSalary
min_age      18.0              NaN
max_age      92.0              NaN
mean_salary   NaN    100090.239881

## Методы объединения

In [12]:
bank = pd.read_csv('bank.csv')
bank.head()

,CustomerId,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited
0,15634602,619,2,0.00,1,1,1,1
1,15647311,608,1,83807.86,1,0,1,0
2,15619304,502,8,159660.80,3,1,0,1
3,15701354,699,1,0.00,2,0,0,0
4,15737888,850,2,125510.82,1,1,1,0

In [22]:
bank.shape

(10000, 8)

In [13]:
merged = users.merge(bank, left_on='CustomerId', right_on='CustomerId')
merged.head()

,CustomerId,Surname,Geography,Gender,Age,EstimatedSalary,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited
0,15634602,Hargrave,France,Female,42,101348.88,619,2,0.00,1,1,1,1
1,15647311,Hill,Spain,Female,41,112542.58,608,1,83807.86,1,0,1,0
2,15619304,Onio,France,Female,42,113931.57,502,8,159660.80,3,1,0,1
3,15701354,Boni,France,Female,39,93826.63,699,1,0.00,2,0,0,0
4,15737888,Mitchell,Spain,Female,43,79084.10,850,2,125510.82,1,1,1,0

In [14]:
users_id = users.set_index('CustomerId')
users_id.head()

             Surname Geography  Gender  Age  EstimatedSalary
CustomerId
15634602    Hargrave    France  Female   42        101348.88
15647311        Hill     Spain  Female   41        112542.58
15619304        Onio    France  Female   42        113931.57
15701354        Boni    France  Female   39         93826.63
15737888    Mitchell     Spain  Female   43         79084.10

In [15]:
bank_id = bank.set_index('CustomerId')
bank_id.head()

,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited
CustomerId,,,,,,,
15634602,619,2,0.00,1,1,1,1
15647311,608,1,83807.86,1,0,1,0
15619304,502,8,159660.80,3,1,0,1
15701354,699,1,0.00,2,0,0,0
15737888,850,2,125510.82,1,1,1,0

In [16]:
bank_id.join(users_id).head()

,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited,Surname,Geography,Gender,Age,EstimatedSalary
CustomerId,,,,,,,,,,,,
15634602,619,2,0.00,1,1,1,1,Hargrave,France,Female,42,101348.88
15647311,608,1,83807.86,1,0,1,0,Hill,Spain,Female,41,112542.58
15619304,502,8,159660.80,3,1,0,1,Onio,France,Female,42,113931.57
15701354,699,1,0.00,2,0,0,0,Boni,France,Female,39,93826.63
15737888,850,2,125510.82,1,1,1,0,Mitchell,Spain,Female,43,79084.10

In [17]:
bank_id.join(users_id).reset_index().head()

,CustomerId,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited,Surname,Geography,Gender,Age,EstimatedSalary
0,15634602,619,2,0.00,1,1,1,1,Hargrave,France,Female,42,101348.88
1,15647311,608,1,83807.86,1,0,1,0,Hill,Spain,Female,41,112542.58
2,15619304,502,8,159660.80,3,1,0,1,Onio,France,Female,42,113931.57
3,15701354,699,1,0.00,2,0,0,0,Boni,France,Female,39,93826.63
4,15737888,850,2,125510.82,1,1,1,0,Mitchell,Spain,Female,43,79084.10

In [18]:
bank.shape

(10000, 8)

### Атрибут how

In [19]:
toy_df1 = pd.DataFrame({
    'col_1': [1, 2, 3],
    'col_2': [9, 9, 9]
})

toy_df2 = pd.DataFrame({
    'col_1': [3, 4],
    'col_3': [0, 0]
})
 
display(toy_df1, toy_df2)

   col_1  col_2
0      1      9
1      2      9
2      3      9

   col_1  col_3
0      3      0
1      4      0

In [30]:
toy_df1.merge(toy_df2, how='left')

   col_1  col_2  col_3
0      1      9    NaN
1      2      9    NaN
2      3      9    0.0

In [31]:
toy_df1.merge(toy_df2, how='right')

   col_1  col_2  col_3
0      3    9.0      0
1      4    NaN      0

In [32]:
toy_df1.merge(toy_df2, how='inner')

   col_1  col_2  col_3
0      3      9      0

In [33]:
toy_df1.merge(toy_df2, how='outer')

   col_1  col_2  col_3
0      1    9.0    NaN
1      2    9.0    NaN
2      3    9.0    0.0
3      4    NaN    0.0

In [20]:
merged_left = bank.merge(users, on='CustomerId', how='left')
merged_left.shape
merged_left.head()

,CustomerId,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited,Surname,Geography,Gender,Age,EstimatedSalary
0,15634602,619,2,0.00,1,1,1,1,Hargrave,France,Female,42,101348.88
1,15647311,608,1,83807.86,1,0,1,0,Hill,Spain,Female,41,112542.58
2,15619304,502,8,159660.80,3,1,0,1,Onio,France,Female,42,113931.57
3,15701354,699,1,0.00,2,0,0,0,Boni,France,Female,39,93826.63
4,15737888,850,2,125510.82,1,1,1,0,Mitchell,Spain,Female,43,79084.10

Метод .isna() в библиотеке Pandas используется для определения пропущенных значений (NaN - Not a Number) в объектах данных, таких как DataFrame и Series. Этот метод возвращает булеву маску, которая указывает, являются ли значения в объекте данных пропущенными (True) или нет (False) для каждого элемента.

In [21]:
merged_left.isna().sum()

CustomerId         0
CreditScore        0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
Exited             0
Surname            0
Geography          0
Gender             0
Age                0
EstimatedSalary    0
dtype: int64

In [36]:
merged_left[merged_left['Age'].isna()]

Empty DataFrame
Columns: [CustomerId, CreditScore, Tenure, Balance, NumOfProducts, HasCrCard, IsActiveMember, Exited, Surname, Geography, Gender, Age, EstimatedSalary]
Index: []

In [24]:
merged_left[(merged_left['CustomerId'] == 15682355) | (merged_left['CustomerId'] == 15628319)]

,CustomerId,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,Exited,Surname,Geography,Gender,Age,EstimatedSalary
9998,15682355,772,3,75075.31,2,1,0,1,Sabbatini,Germany,Male,42,92888.52
9999,15628319,792,4,130142.79,1,1,0,0,Walker,France,Female,28,38190.78